# pandas: tutorial (Day-11)
This notebook will explains

# install libiray

In [ ]:
#  pip install pandas
#  pip install numpy

- import library

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Object creation
s = pd.Series([1,3,np.nan,5,8,9])
s

In [1]:
datas = pd.date_range("20220101", periods=20)
datas

NameError: name 'pd' is not defined

In [ ]:
datas = pd.date_range("20220101", periods=6)
datas
df = pd.DataFrame(np.random.randn(6,4), index=datas, columns=list("ABYZ"))

df

In [ ]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20221122"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["girls","woman","girls","woman"]),
        "F": "females",
    }
)
df2

In [ ]:
df2.dtypes

In [ ]:
df2.head(2)

In [ ]:
df2.tail(2)

In [ ]:
df2.index

In [ ]:
df.to_numpy

In [ ]:
df2.to_numpy()

In [ ]:
df2.describe()

# Transpose Data

In [ ]:
df2.T

# Sorting by indexing

In [ ]:
df.sort_index(axis=0, ascending=True)

In [ ]:
df.sort_index(axis=0, ascending=False)

In [ ]:
# sort by value/ colum b
df.sort_values(by="B")

In [ ]:
df["A"]

In [ ]:
# row wise selection
df[0:3]

## row vis and colum vis selection

In [ ]:
df.loc[datas[3]]

In [ ]:
df.loc[:,["A","B"]]

In [ ]:
df.loc["20220102":"20220202",["A","B"]]

In [ ]:
df.loc[["20220102","20220106"],["A","B"]]

In [ ]:
df.loc["20220102",["A","B"]]

In [ ]:
df.at[datas[3],"A"]

In [ ]:
df.iloc[3]

In [ ]:
df.iloc[0:5,:]

In [ ]:
df.iloc[:,0:2]

In [ ]:
df[df["B"] >1]

In [ ]:
df[df >1]

## is in method

In [ ]:
df3=df.copy()
df3["E"] = ["one","two","three","four","five","six"]
df3

In [ ]:
# adding colum
df3["means"]=[1,2,23,11,23,12]
df3

# A+B+C+D ki avg and print in new colum

Pandas Case Study

In [ ]:
pip install matplotlib.pyplot

In [5]:
# import libraries
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
jahaz = sns.load_dataset("titanic")
jahaz.head()

# saving dataframe into csv file
jahaz.to_csv("jahaz.csv")

In [11]:
# basic statis or summary

jahaz.describe()
jahaz.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [18]:
# droping few colums and make new data set

new_jahaz= jahaz.drop(['deck','alone'], axis=1).head(2)
new_jahaz

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes

In [21]:
jahaz.value_counts(["survived"])

survived
0           549
1           342
dtype: int64

In [20]:
jahaz.groupby(['sex']).mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [22]:
jahaz.groupby(["sex","class"]).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.968085     1.0  34.611765  0.553191  0.457447  106.125798
       Second  0.921053     2.0  28.722973  0.486842  0.605263   21.970121
       Third   0.500000     3.0  21.750000  0.895833  0.798611   16.118810
male   First   0.368852     1.0  41.281386  0.311475  0.278689   67.226127
       Second  0.157407     2.0  30.740707  0.342593  0.222222   19.741782
       Third   0.135447     3.0  26.507589  0.498559  0.224784   12.661633

               adult_male     alone
sex    class
female First     0.000000  0.361702
       Second    0.000000  0.421053
       Third     0.000000  0.416667
male   First     0.975410  0.614754
       Second    0.916667  0.666667
       Third     0.919308  0.760807

In [24]:
# # add children 
jahaz[jahaz ['age'] < 18].mean()

C:\Users\ayaz\AppData\Local\Temp\ipykernel_11636\50384896.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  jahaz[jahaz ['age'] < 18].mean()

survived       0.539823
pclass         2.584071
age            9.041327
sibsp          1.460177
parch          1.053097
fare          31.220798
adult_male     0.159292
alone          0.203540
dtype: float64

In [25]:
jahaz[jahaz ['age'] < 18].groupby(["sex","class"]).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.875000     1.0  14.125000  0.500000  0.875000  104.083337
       Second  1.000000     2.0   8.333333  0.583333  1.083333   26.241667
       Third   0.542857     3.0   8.428571  1.571429  1.057143   18.727977
male   First   1.000000     1.0   8.230000  0.500000  2.000000  116.072900
       Second  0.818182     2.0   4.757273  0.727273  1.000000   25.659473
       Third   0.232558     3.0   9.963256  2.069767  1.000000   22.752523

               adult_male     alone
sex    class
female First     0.000000  0.125000
       Second    0.000000  0.166667
       Third     0.000000  0.228571
male   First     0.250000  0.000000
       Second    0.181818  0.181818
       Third     0.348837  0.232558

In [ ]:
# you have to code FAO website
# apni marzi ka data lana hy and work